MinhTuanEE76/STM32F407XXX_DRIVER/drivers/can/Src/stm32f407xxx_can.c
#include "stm32f407xxx_can.h"
#include "stm32f407xxx_systick.h"

#define NULL ((void *)0)
#define CAN_TIMEOUT_VALUE 1000U

uint32_t tickstart = 0;

/*< General CAN initialization function
1. validate the input parameters: hcan NULL,instance,init,baudrate,mode
2. check driver state: tx/rx busy, reject init if busy
3. update state to busy
4. exit sleep mode if requested and enter initialization mode
5. clear old configuration of MCR BTR
6. configure MCR and BTR based on Init parameters
7. Config operating mode
8. configure bit timing parameters
9. exit initialization mode and update state to ready
10. clear error code
11. Update state to ready
12. return status
*/
CAN_Status_t CAN_Init(CAN_Handle_t *hcan)
{
    tickstart = SYSTICK_GetTick();
    if (hcan == NULL)
    {
        return CAN_ERROR;
    }

    hcan->ErrorCode = CAN_ERROR_NONE;

    if (hcan->Instance == NULL)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    if (hcan->State == CAN_STATE_BUSY)
    {
        return CAN_BUSY;
    }

    if (hcan->Init.Mode > CAN_MODE_SILENT_LOOPBACK)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }
    // validate timing
    if (hcan->Init.BitTiming.Prescaler < 1U || hcan->Init.BitTiming.Prescaler > 1024U)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    if (hcan->Init.BitTiming.TS1 < 1U ||
        hcan->Init.BitTiming.TS1 > 16U)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    if (hcan->Init.BitTiming.TS2 < 1U || hcan->Init.BitTiming.TS2 > 8U)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    if (hcan->Init.BitTiming.SJW < 1U || hcan->Init.BitTiming.SJW > 4U)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    if (hcan->Init.BitTiming.SJW > hcan->Init.BitTiming.TS2)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    // update state to busy
    hcan->State = CAN_STATE_BUSY;

    /*< exit sleep mode to enter initialization mode */
    if (hcan->Instance->MSR & CAN_MSR_SLAK)
    {
        hcan->Instance->MCR &= ~CAN_MCR_SLEEP; // exit sleep mode
        tickstart = SYSTICK_GetTick();
        while (hcan->Instance->MSR & CAN_MSR_SLAK) // wait until SLAK bit is cleared
        {
            if (SYSTICK_GetTick() - tickstart > CAN_TIMEOUT_VALUE)
            {
                hcan->ErrorCode |= CAN_ERROR_TIMEOUT;
                hcan->State = CAN_STATE_TIMEOUT;
                return CAN_TIMEOUT;
            }
        }
    }

    hcan->Instance->MCR |= CAN_MCR_INRQ; // enter initialization mode
    tickstart = SYSTICK_GetTick();
    while (!(hcan->Instance->MSR & CAN_MSR_INAK)) // wait until INAK bit is set
    {
        if (SYSTICK_GetTick() - tickstart > CAN_TIMEOUT_VALUE)
        {
            hcan->ErrorCode |= CAN_ERROR_TIMEOUT;
            hcan->State = CAN_STATE_TIMEOUT;
            return CAN_TIMEOUT;
        }
    }

    // clear old configuration of MCR BTR
    hcan->Instance->MCR &= ~(CAN_MCR_TXFP |
                             CAN_MCR_RFLM |
                             CAN_MCR_NART |
                             CAN_MCR_AWUM |
                             CAN_MCR_ABOM);

    hcan->Instance->BTR &= ~(CAN_BTR_LBKM | CAN_BTR_SILM);

    // configure features based on Init parameters
    if (hcan->Init.AutoBussOff)
    {
        hcan->Instance->MCR |= CAN_MCR_ABOM; // set bit auto bus-off management
    }
    /*-----------------------------------------------------------------------------*/
    if (hcan->Init.AutoWakeUp)
    {
        hcan->Instance->MCR |= CAN_MCR_AWUM; // set bit auto wake-up mode
    }
    /*-----------------------------------------------------------------------------*/
    if (hcan->Init.AutoRetransmission)
    {
        hcan->Instance->MCR &= ~CAN_MCR_NART; // clear bit to enable auto retransmission
    }
    else
    {
        hcan->Instance->MCR |= CAN_MCR_NART; // set bit to disable auto retransmission
    }
    /*-----------------------------------------------------------------------------*/
    if (hcan->Init.ReceiveFifoLocked)
    {
        hcan->Instance->MCR |= CAN_MCR_RFLM; // receive FIFO locked mode = 1 ->discard new message when FIFO is full
    }
    else
    {
        hcan->Instance->MCR &= ~CAN_MCR_RFLM; // receive FIFO locked mode = 0 -> overwrite old message when FIFO is full
    }
    /*-----------------------------------------------------------------------------*/
    if (hcan->Init.TransmitFifoPriority)
    {
        hcan->Instance->MCR |= CAN_MCR_TXFP; // transmit FIFO priority by the order of requests
    }
    else
    {
        hcan->Instance->MCR &= ~CAN_MCR_TXFP; // transmit FIFO priority by the identifier of the message
    }

    // configure operating mode
    switch (hcan->Init.Mode)
    {
    case CAN_MODE_NORMAL:
        break;

    case CAN_MODE_LOOPBACK:
        hcan->Instance->BTR |= CAN_BTR_LBKM;
        break;

    case CAN_MODE_SILENT:
        hcan->Instance->BTR |= CAN_BTR_SILM;
        break;

    case CAN_MODE_SILENT_LOOPBACK:
        hcan->Instance->BTR |= (CAN_BTR_LBKM | CAN_BTR_SILM);
        break;

    default:
        hcan->State = CAN_STATE_ERROR;
        hcan->ErrorCode |= CAN_ERROR_PARAM;

        return CAN_ERROR;
    }

    // configure bit timing parameters
    hcan->Instance->BTR &= ~(CAN_BTR_BRP_Msk |
                             CAN_BTR_TS1_Msk |
                             CAN_BTR_TS2_Msk |
                             CAN_BTR_SJW_Msk); // clear BTR before configuring

    hcan->Instance->BTR |= ((hcan->Init.BitTiming.Prescaler - 1U) << CAN_BTR_BRP_Pos) & CAN_BTR_BRP_Msk;
    hcan->Instance->BTR |= ((hcan->Init.BitTiming.TS1 - 1U) << CAN_BTR_TS1_Pos) & CAN_BTR_TS1_Msk;
    hcan->Instance->BTR |= ((hcan->Init.BitTiming.TS2 - 1U) << CAN_BTR_TS2_Pos) & CAN_BTR_TS2_Msk;
    hcan->Instance->BTR |= ((hcan->Init.BitTiming.SJW - 1U) << CAN_BTR_SJW_Pos) & CAN_BTR_SJW_Msk;

    // update state to ready
    hcan->State = CAN_STATE_READY;

    return CAN_OK;
}

/*Initialize filter
1. Validate parameters
   - bank
   - scale
   - mode
   - fifo
   - etc
2. Enter filter init mode FMR.FINIT = 1
3. Disable target filter bank FA1R &= ~
4. Configure filter scale FS1R
5. Configure filter mode FM1R
6. Configure FIFO assignment FFA1R
7. Write FR1/FR2
8. Activate filter if requested FA1R |=
9. Exit filter init mode FMR.FINIT = 0
*/
/*< Configure CAN filter */
CAN_Status_t CAN_ConfigFilter(CAN_Handle_t *hcan, CAN_FilterConfig_t *FilterConfig)
{
    // Validate parameters
    if (hcan == NULL || FilterConfig == NULL)
    {
        return CAN_ERROR;
    }

