MinhTuanEE76/STM32F407XXX_DRIVER/drivers/can/Src/stm32f407xxx_can.c
    hcan->ErrorCode = CAN_ERROR_NONE;

    /* check CAN instance */
    if (hcan->Instance == NULL)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /* validate filter bank
     * bxCAN on STM32F407 has 28 filter banks: 0 -> 27
     */
    if (FilterConfig->FilterBank > 27U)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /* validate filter mode */
    if (FilterConfig->FilterMode > CAN_FILTERMODE_IDLIST)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /* validate filter scale */
    if (FilterConfig->FilterScale > CAN_FILTER_SCALE_32BIT)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /* validate FIFO assignment */
    if (FilterConfig->FifoAssignment > CAN_RX_FIFO1)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /*=====================================================
     * Enter filter initialization mode
     *
     * FINIT = 1:
     * - Freeze all filters
     * - Allow software to modify filter registers
     *=====================================================*/
    hcan->Instance->FMR |= CAN_FMR_FINIT;

    /*=====================================================
     * Disable filter before reconfiguration
     *
     * IMPORTANT:
     * Filter must be deactivated before changing:
     * - scale
     * - mode
     * - FR1/FR2
     *=====================================================*/
    hcan->Instance->FA1R &= ~(1U << FilterConfig->FilterBank);

    /*=====================================================
     * Configure filter scale
     *
     * FSCx = 0 -> 16-bit scale
     * FSCx = 1 -> 32-bit scale
     *=====================================================*/
    if (FilterConfig->FilterScale == CAN_FILTER_SCALE_32BIT)
    {
        hcan->Instance->FS1R |= (1U << FilterConfig->FilterBank);
    }
    else
    {
        hcan->Instance->FS1R &= ~(1U << FilterConfig->FilterBank);
    }

    /*=====================================================
     * Configure filter mode
     *
     * FBMx = 0 -> Mask mode
     * FBMx = 1 -> List mode
     *=====================================================*/
    if (FilterConfig->FilterMode == CAN_FILTERMODE_IDLIST)
    {
        hcan->Instance->FM1R |= (1U << FilterConfig->FilterBank);
    }
    else
    {
        hcan->Instance->FM1R &= ~(1U << FilterConfig->FilterBank);
    }

    /*=====================================================
     * Configure FIFO assignment
     *
     * FFAx = 0 -> FIFO0
     * FFAx = 1 -> FIFO1
     *=====================================================*/
    if (FilterConfig->FifoAssignment == CAN_RX_FIFO1)
    {
        hcan->Instance->FFA1R |= (1U << FilterConfig->FilterBank);
    }
    else
    {
        hcan->Instance->FFA1R &= ~(1U << FilterConfig->FilterBank);
    }

    /*=====================================================
     * Configure filter registers
     *
     * IMPORTANT:
     *
     * bxCAN filter format is NOT fixed.
     *
     * The meaning of FR1/FR2 depends on:
     * - 16-bit / 32-bit mode
     * - Mask mode / List mode
     * - Standard / Extended ID
     *
     * Therefore:
     * Driver only writes raw packed values.
     *
     * User/helper function must prepare
     * correctly formatted values before calling.
     *=====================================================*/

    /*-----------------------------------------------------
     * 32-bit scale
     *-----------------------------------------------------
     * MASK MODE:
     *   FR1 = ID
     *   FR2 = MASK
     *
     * LIST MODE:
     *   FR1 = ID1
     *   FR2 = ID2
     *----------------------------------------------------*/
    if (FilterConfig->FilterScale == CAN_FILTER_SCALE_32BIT)
    {
        hcan->Instance->sFilterRegister[FilterConfig->FilterBank].FR1 = FilterConfig->FilterID1;
        hcan->Instance->sFilterRegister[FilterConfig->FilterBank].FR2 = FilterConfig->FilterID2;
    }
    /*-----------------------------------------------------
     * 16-bit scale
     *-----------------------------------------------------
     * FR1 and FR2 each contain:
     * - two 16-bit fields
     *
     * User must pack data manually.
     *----------------------------------------------------*/
    else
    {
        hcan->Instance->sFilterRegister[FilterConfig->FilterBank].FR1 = FilterConfig->FilterID1;

        hcan->Instance->sFilterRegister[FilterConfig->FilterBank].FR2 = FilterConfig->FilterID2;
    }

    /*=====================================================
     * Activate filter if requested
     *
     * FACTx = 1 -> filter enabled
     * FACTx = 0 -> filter disabled
     *=====================================================*/
    if (FilterConfig->FilterActivation == CAN_FILTER_ENABLE)
    {
        hcan->Instance->FA1R |= (1U << FilterConfig->FilterBank);
    }
    else
    {
        hcan->Instance->FA1R &= ~(1U << FilterConfig->FilterBank);
    }

    /*=====================================================
     * Exit filter initialization mode
     *
     * FINIT = 0:
     * Filters become active again
     *=====================================================*/
    hcan->Instance->FMR &= ~CAN_FMR_FINIT;

    return CAN_OK;
}

/*=========================================================
 * CAN_Start
 *
 * Leave initialization mode and start CAN operation
 *
 * After this function:
 * - CAN participates on the bus
 * - TX/RX becomes active
 *=========================================================*/
CAN_Status_t CAN_Start(CAN_Handle_t *hcan)
{
    uint32_t tickstart = SYSTICK_GetTick();

    /* Check NULL handle */
    if (hcan == NULL)
    {
        return CAN_ERROR;
    }

    /* Clear previous error */
    hcan->ErrorCode = CAN_ERROR_NONE;

    /* Check CAN instance */
    if (hcan->Instance == NULL)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /*-----------------------------------------------------
     * CAN must already be initialized
     *
     * Allowed states:
     * - READY
     * - STOPPED
     *----------------------------------------------------*/
    if ((hcan->State != CAN_STATE_READY) && (hcan->State != CAN_STATE_STOPPED))
    {
        hcan->ErrorCode |= CAN_ERROR_NOT_INITIALIZED;
        return CAN_ERROR;
    }

