MinhTuanEE76/STM32F407XXX_DRIVER/drivers/can/Src/stm32f407xxx_can.c
    /*Exit sleep mode if peripheral is sleeping*/
    if (hcan->Instance->MSR & CAN_MSR_SLAK)
    {
        hcan->Instance->MCR &= ~CAN_MCR_SLEEP;

        tickstart = SYSTICK_GetTick();

        while (hcan->Instance->MSR & CAN_MSR_SLAK)
        {
            if ((SYSTICK_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
            {
                hcan->ErrorCode |= CAN_ERROR_TIMEOUT;
                hcan->State = CAN_STATE_ERROR;

                return CAN_TIMEOUT;
            }
        }
    }

    /* Leave initialization mode*/
    hcan->Instance->MCR &= ~CAN_MCR_INRQ;

    /* Wait until INAK cleared by hardware */
    tickstart = SYSTICK_GetTick();

    while (hcan->Instance->MSR & CAN_MSR_INAK)
    {
        if ((SYSTICK_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
        {
            hcan->ErrorCode |= CAN_ERROR_TIMEOUT;
            hcan->State = CAN_STATE_ERROR;

            return CAN_TIMEOUT;
        }
    }

    /* CAN is now operational */
    hcan->State = CAN_STATE_ACTIVE;
    return CAN_OK;
}

/*=========================================================
 * CAN_Stop
 *
 * Enter initialization mode
 *
 * After this function:
 * - CAN stops participating on bus
 * - TX/RX disabled
 * - Registers can be safely reconfigured
 *=========================================================*/
CAN_Status_t CAN_Stop(CAN_Handle_t *hcan)
{
    uint32_t tickstart = SYSTICK_GetTick();

    /* Check NULL handle */
    if (hcan == NULL)
    {
        return CAN_ERROR;
    }

    /* Clear previous error */
    hcan->ErrorCode = CAN_ERROR_NONE;

    /* Check CAN instance */
    if (hcan->Instance == NULL)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /*-----------------------------------------------------
     * Enter initialization mode
     *
     * INRQ = 1
     *----------------------------------------------------*/
    hcan->Instance->MCR |= CAN_MCR_INRQ;

    /* Wait until hardware sets INAK */
    while (!(hcan->Instance->MSR & CAN_MSR_INAK))
    {
        if ((SYSTICK_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
        {
            hcan->ErrorCode |= CAN_ERROR_TIMEOUT;
            hcan->State = CAN_STATE_ERROR;

            return CAN_TIMEOUT;
        }
    }

    /*-----------------------------------------------------
     * CAN stopped
     *----------------------------------------------------*/
    hcan->State = CAN_STATE_STOPPED;

    return CAN_OK;
}

/*=========================================================
 * CAN_RequestSleep
 *
 * Put CAN peripheral into sleep mode
 *
 * NOTE:
 * - Peripheral stops bus activity
 * - Registers are retained
 *=========================================================*/
CAN_Status_t CAN_RequestSleep(CAN_Handle_t *hcan)
{
    uint32_t tickstart = SYSTICK_GetTick();

    /* Check NULL handle */
    if (hcan == NULL)
    {
        return CAN_ERROR;
    }

    /* Clear previous error */
    hcan->ErrorCode = CAN_ERROR_NONE;

    /* Check instance */
    if (hcan->Instance == NULL)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /*-----------------------------------------------------
     * Request sleep mode
     *
     * SLEEP = 1
     *----------------------------------------------------*/
    hcan->Instance->MCR |= CAN_MCR_SLEEP;

    /* Wait until SLAK set */
    while (!(hcan->Instance->MSR & CAN_MSR_SLAK))
    {
        if ((SYSTICK_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
        {
            hcan->ErrorCode |= CAN_ERROR_TIMEOUT;
            hcan->State = CAN_STATE_ERROR;

            return CAN_TIMEOUT;
        }
    }

    /* Peripheral is sleeping */
    hcan->State = CAN_STATE_SLEEP;

    return CAN_OK;
}

/*=========================================================
 * CAN_WakeUp
 *
 * Wake CAN peripheral from sleep mode
 *
 * NOTE:
 * This function ONLY leaves sleep mode.
 * CAN still remains in initialization mode
 * until CAN_Start() is called.
 *=========================================================*/
CAN_Status_t CAN_WakeUp(CAN_Handle_t *hcan)
{
    uint32_t tickstart = SYSTICK_GetTick();

    /* Check NULL handle */
    if (hcan == NULL)
    {
        return CAN_ERROR;
    }

    /* Clear previous error */
    hcan->ErrorCode = CAN_ERROR_NONE;

    /* Check instance */
    if (hcan->Instance == NULL)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    /*-----------------------------------------------------
     * Peripheral must be in sleep state
     *----------------------------------------------------*/
    if (hcan->State != CAN_STATE_SLEEP)
    {
        hcan->ErrorCode |= CAN_ERROR_STATE;
        return CAN_ERROR;
    }

    /*-----------------------------------------------------
     * Clear sleep request
     *
     * SLEEP = 0
     *----------------------------------------------------*/
    hcan->Instance->MCR &= ~CAN_MCR_SLEEP;

    /* Wait until SLAK cleared */
    while (hcan->Instance->MSR & CAN_MSR_SLAK)
    {
        if ((SYSTICK_GetTick() - tickstart) > CAN_TIMEOUT_VALUE)
        {
            hcan->ErrorCode |= CAN_ERROR_TIMEOUT;
            hcan->State = CAN_STATE_ERROR;

            return CAN_TIMEOUT;
        }
    }
    /*-----------------------------------------------------
     * Peripheral awake but not started yet
     *----------------------------------------------------*/
    hcan->State = CAN_STATE_STOPPED;

    return CAN_OK;
}

/*=========================================================
 * CAN_Add_TxMessage
 *
 * Add message to Tx mailbox and request transmission
 *
 * NOTE:
 * - User must fill TxFrame structure before calling
 * - This function does NOT check if Tx mailbox is free or not
 *=========================================================*/
CAN_Status_t CAN_Add_TxMessage(CAN_Handle_t *hcan, CAN_TxFrame_t *TxFrame)
{
    if (hcan == NULL || TxFrame == NULL)
    {
        return CAN_ERROR;
    }
    /* Check instance */
    if (hcan->Instance == NULL)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_ERROR;
    }

    // check mailbox availability
    uint8_t available_mailbox = 0xFF; // 0xFF indicates no mailbox available
    if (hcan->Instance->TSR & CAN_TSR_TME0)
    {
        // Maibox[0] is free
        if (TxFrame->IDE == CAN_ID_STANDARD)
        {
            available_mailbox = 0;
            hcan->Instance->sTxMailBox[0].TIR &= ~CAN_TIR_IDE;                      // standard ID
            hcan->Instance->sTxMailBox[0].TIR |= (TxFrame->RTR << CAN_TIR_RTR_Pos); // set RTR bit
            hcan->Instance->sTxMailBox[0].TIR &= ~CAN_TIR_STID;
            hcan->Instance->sTxMailBox[0].TIR |= TxFrame->ID << CAN_TIR_STID_Pos; // set standard ID
        }
        else
        {
            hcan->Instance->sTxMailBox[0].TIR |= CAN_TIR_IDE;                       // extended ID
            hcan->Instance->sTxMailBox[0].TIR |= (TxFrame->RTR << CAN_TIR_RTR_Pos); // set RTR bit
            hcan->Instance->sTxMailBox[0].TIR &= ~CAN_TIR_EXID;
            hcan->Instance->sTxMailBox[0].TIR |= (TxFrame->ID << CAN_TIR_EXID_Pos); // set extended ID
        }
    }
    else if (hcan->Instance->TSR & CAN_TSR_TME1)
    {
        // Mailbox[1] is free
        available_mailbox = 1;
        if (TxFrame->IDE == CAN_ID_STANDARD)
        {
            hcan->Instance->sTxMailBox[1].TIR &= ~CAN_TIR_IDE;                      // standard ID
            hcan->Instance->sTxMailBox[1].TIR |= (TxFrame->RTR << CAN_TIR_RTR_Pos); // set RTR bit
            hcan->Instance->sTxMailBox[1].TIR &= ~CAN_TIR_STID;
            hcan->Instance->sTxMailBox[1].TIR |= TxFrame->ID << CAN_TIR_STID_Pos; // set standard ID
        }
        else
        {
            hcan->Instance->sTxMailBox[1].TIR |= CAN_TIR_IDE;                       // extended ID
            hcan->Instance->sTxMailBox[1].TIR |= (TxFrame->RTR << CAN_TIR_RTR_Pos); // set RTR bit
            hcan->Instance->sTxMailBox[1].TIR &= ~CAN_TIR_EXID;
            hcan->Instance->sTxMailBox[1].TIR |= (TxFrame->ID << CAN_TIR_EXID_Pos); // set extended ID
        }
    }
    else if (hcan->Instance->TSR & CAN_TSR_TME2)
    {
        // Mailbox[2] is free
        available_mailbox = 2;
        if (TxFrame->IDE == CAN_ID_STANDARD)
        {
            hcan->Instance->sTxMailBox[2].TIR &= ~CAN_TIR_IDE;                      // standard ID
            hcan->Instance->sTxMailBox[2].TIR |= (TxFrame->RTR << CAN_TIR_RTR_Pos); // set RTR bit
            hcan->Instance->sTxMailBox[2].TIR &= ~CAN_TIR_STID;
            hcan->Instance->sTxMailBox[2].TIR |= TxFrame->ID << CAN_TIR_STID_Pos; // set standard ID
        }
        else
        {
            hcan->Instance->sTxMailBox[2].TIR |= CAN_TIR_IDE;                       // extended ID
            hcan->Instance->sTxMailBox[2].TIR |= (TxFrame->RTR << CAN_TIR_RTR_Pos); // set RTR bit
            hcan->Instance->sTxMailBox[2].TIR &= ~CAN_TIR_EXID;
            hcan->Instance->sTxMailBox[2].TIR |= (TxFrame->ID << CAN_TIR_EXID_Pos); // set extended ID
        }
    }
    else
    {
        // No mailbox is free
        hcan->ErrorCode |= CAN_ERROR_TX_MAILBOX_FULL;
        return CAN_BUSY;
    }

    // Set DLC and data
    hcan->Instance->sTxMailBox[available_mailbox].TDTR &= ~CAN_TDTR_DLC;
    hcan->Instance->sTxMailBox[available_mailbox].TDTR |= (TxFrame->DLC << CAN_TDTR_DLC_Pos);
    for (uint8_t i = 0; i < TxFrame->DLC; i++)
    {
        if (i < 4)
        {
            hcan->Instance->sTxMailBox[available_mailbox].TDLR &= ~(0xFFU << (8 * i));         // clear previous data
            hcan->Instance->sTxMailBox[available_mailbox].TDLR |= TxFrame->Data[i] << (8 * i); // pack data into TDLR
        }
        else
        {
            hcan->Instance->sTxMailBox[available_mailbox].TDHR &= ~(0xFFU << (8 * (i - 4)));         // clear previous data
            hcan->Instance->sTxMailBox[available_mailbox].TDHR |= TxFrame->Data[i] << (8 * (i - 4)); // pack data into TDHR
        }
    }
    // Request transmission
    hcan->Instance->sTxMailBox[available_mailbox].TIR |= CAN_TIR_TXRQ;
    return CAN_OK;
}

/*CAN get TX mailboxes status*/
CAN_TxMailboxStatus_t CAN_Get_TxMailboxesStatus(CAN_Handle_t *hcan, uint8_t Mailbox)
{
    if (hcan == NULL)
    {
        return CAN_TX_MAILBOX_INVALID;
    }
    // Check instance
    if (hcan->Instance == NULL)
    {
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_TX_MAILBOX_INVALID;
    }

    switch (Mailbox)
    {
    case CAN_TX_MAILBOX_0:
        if (hcan->Instance->TSR & CAN_TSR_RQCP0)
        {
            if (hcan->Instance->TSR & CAN_TSR_TXOK0)
            {
                // transmission successful
                hcan->Instance->TSR |= CAN_TSR_RQCP0; // clear RQCP0 by writing 1
                return CAN_TX_MAILBOX_SUCCESS;
            }
            else
            {
                // check error code
                if (hcan->Instance->TSR & CAN_TSR_TERR0)
                {
                    hcan->ErrorCode |= CAN_ERROR_STATE;
                }
                // check specific error type in ESR
                /*if REC or TEC >= 128 --> error passive*/
                if (hcan->Instance->ESR & CAN_ESR_EPVF)
                {
                    hcan->ErrorCode |= CAN_ERROR_PASSIVE;
                }
                /*if REC or TEC  >= 96 --> warning state*/
                if (hcan->Instance->ESR & CAN_ESR_EWGF)
                {
                    hcan->ErrorCode |= CAN_ERROR_WARNING;
                }
                /*if TEC >= 256 --> bus off*/
                if (hcan->Instance->ESR & CAN_ESR_BOFF)
                {
                    hcan->ErrorCode |= CAN_ERROR_BUS_OFF;
                }

                if (hcan->Instance->ESR & CAN_ESR_LEC_Msk)
                {
                    uint32_t lec = (hcan->Instance->ESR & CAN_ESR_LEC_Msk) >> CAN_ESR_LEC_Pos;
                    switch (lec)
                    {
                    case 0x1:
                        hcan->ErrorCode |= CAN_ERROR_STUFF;
                        break;
                    case 0x2:
                        hcan->ErrorCode |= CAN_ERROR_FORM;
                        break;
                    case 0x3:
                        hcan->ErrorCode |= CAN_ERROR_ACK;
                        break;
                    case 0x4:
                        hcan->ErrorCode |= CAN_ERROR_BIT_RECESSIVE;
                        break;
                    case 0x5:
                        hcan->ErrorCode |= CAN_ERROR_BIT_DOMINANT;
                        break;
                    case 0x6:
                        hcan->ErrorCode |= CAN_ERROR_CRC;
                        break;
                    default:
                        break;
                    }
                }
                return CAN_TX_MAILBOX_FAILED;
            }
        }
        else
        {
            return CAN_TX_MAILBOX_PENDING;
        }
        break;
    /*Mailbox1*/
    case CAN_TX_MAILBOX_1:
        if (hcan->Instance->TSR & CAN_TSR_RQCP1)
        {
            if (hcan->Instance->TSR & CAN_TSR_TXOK1)
            {
                // transmission successful
                hcan->Instance->TSR |= CAN_TSR_RQCP1; // clear RQCP1 by writing 1
                return CAN_TX_MAILBOX_SUCCESS;
            }
            else
            {
                hcan->Instance->TSR |= CAN_TSR_RQCP1; // clear RQCP1 by writing 1
                // check error code
                if (hcan->Instance->TSR & CAN_TSR_TERR1)
                {
                    hcan->ErrorCode |= CAN_ERROR_STATE;
                }
                // check specific error type in ESR
                /*if REC or TEC >= 128 --> error passive*/
                if (hcan->Instance->ESR & CAN_ESR_EPVF)
                {
                    hcan->ErrorCode |= CAN_ERROR_PASSIVE;
                }
                /*if REC or TEC  >= 96 --> warning state*/
                if (hcan->Instance->ESR & CAN_ESR_EWGF)
                {
                    hcan->ErrorCode |= CAN_ERROR_WARNING;
                }
                /*if TEC >= 256 --> bus off*/
                if (hcan->Instance->ESR & CAN_ESR_BOFF)
                {
                    hcan->ErrorCode |= CAN_ERROR_BUS_OFF;
                }

                if (hcan->Instance->ESR & CAN_ESR_LEC_Msk)
                {
                    uint32_t lec = (hcan->Instance->ESR & CAN_ESR_LEC_Msk) >> CAN_ESR_LEC_Pos;
                    switch (lec)
                    {
                    case 0x1:
                        hcan->ErrorCode |= CAN_ERROR_STUFF;
                        break;
                    case 0x2:
                        hcan->ErrorCode |= CAN_ERROR_FORM;
                        break;
                    case 0x3:
                        hcan->ErrorCode |= CAN_ERROR_ACK;
                        break;
                    case 0x4:
                        hcan->ErrorCode |= CAN_ERROR_BIT_RECESSIVE;
                        break;
                    case 0x5:
                        hcan->ErrorCode |= CAN_ERROR_BIT_DOMINANT;
                        break;
                    case 0x6:
                        hcan->ErrorCode |= CAN_ERROR_CRC;
                        break;
                    default:
                        break;
                    }
                }
                return CAN_TX_MAILBOX_FAILED;
            }
        }
        else
        {
            return CAN_TX_MAILBOX_PENDING;
        }
        break;
    /*Mailbox2*/
    case CAN_TX_MAILBOX_2:
        if (hcan->Instance->TSR & CAN_TSR_RQCP2)
        {
            if (hcan->Instance->TSR & CAN_TSR_TXOK2)
            {
                // transmission successful
                hcan->Instance->TSR |= CAN_TSR_RQCP2; // clear RQCP2 by writing 1
                return CAN_TX_MAILBOX_SUCCESS;
            }
            else
            {
                // check error code
                if (hcan->Instance->TSR & CAN_TSR_TERR2)
                {
                    hcan->ErrorCode |= CAN_ERROR_STATE;
                }
                // check specific error type in ESR
                /*if REC or TEC >= 128 --> error passive*/
                if (hcan->Instance->ESR & CAN_ESR_EPVF)
                {
                    hcan->ErrorCode |= CAN_ERROR_PASSIVE;
                }
                /*if REC or TEC  >= 96 --> warning state*/
                if (hcan->Instance->ESR & CAN_ESR_EWGF)
                {
                    hcan->ErrorCode |= CAN_ERROR_WARNING;
                }
                /*if TEC >= 256 --> bus off*/
                if (hcan->Instance->ESR & CAN_ESR_BOFF)
                {
                    hcan->ErrorCode |= CAN_ERROR_BUS_OFF;
                }

                if (hcan->Instance->ESR & CAN_ESR_LEC_Msk)
                {
                    uint32_t lec = (hcan->Instance->ESR & CAN_ESR_LEC_Msk) >> CAN_ESR_LEC_Pos;
                    switch (lec)
                    {
                    case 0x1:
                        hcan->ErrorCode |= CAN_ERROR_STUFF;
                        break;
                    case 0x2:
                        hcan->ErrorCode |= CAN_ERROR_FORM;
                        break;
                    case 0x3:
                        hcan->ErrorCode |= CAN_ERROR_ACK;
                        break;
                    case 0x4:
                        hcan->ErrorCode |= CAN_ERROR_BIT_RECESSIVE;
                        break;
                    case 0x5:
                        hcan->ErrorCode |= CAN_ERROR_BIT_DOMINANT;
                        break;
                    case 0x6:
                        hcan->ErrorCode |= CAN_ERROR_CRC;
                        break;
                    default:
                        break;
                    }
                }
                hcan->Instance->TSR |= CAN_TSR_RQCP2; // clear RQCP2 by writing 1
                return CAN_TX_MAILBOX_FAILED;
            }
        }
        else
        {
            return CAN_TX_MAILBOX_PENDING;
        }
        break;

    default:
        hcan->ErrorCode |= CAN_ERROR_PARAM;
        return CAN_TX_MAILBOX_INVALID;
    }
}
/*---------------------------------------End CAN get status of tx mailboxes---------------------------------------*/

